import numpy as np
from sentence_transformers import SentenceTransformer

#  تحميل النموذج من المسار المحلي
model = SentenceTransformer("E:/Models/arabert")

#  قائمة الفيديوهات المتاحة
video_titles = [
    "ابني عنيد ، ابني لا يسمع كلامي !",
    "أخطاء وقعت فيها مع ابني سببت رفضه الطعام - اعرفيها وتجنبيها",
    "اسباب وعلاج رفض الاطفال الاكل",
    "ازاي تربي طفل هادئ؟ كيفية التعامل مع الطفل العصبي كثير البكاء - دعاء كرسون",
    "ازاي تربي طفلك تربية صح ؟ _ ٦ اخطاء منتشرة في تربية الأطفال اعرفيها وتجنبيها",
    "ازاي طفلي يحب الاكل ؟ طفلي يرمي الطعام _ ما الحل؟",
    "ازاي نحب أطفالنا صح ونبني معاهم علاقة صحية قوية؟ _ لغات الحب عند الأطفال",
    "ازاي نعاقب أطفالنا ونصحح أخطائهم بطريقة صح؟",
    "ازاي نغرس حب الدين في قلوب أطفالنا؟",
    "إستقبال المولود الثاني _ علاج الغيرة بين الإخوات",
    "الام العصبية خطوات اساسية للسيطرة على العصبية والقلق والتوتر عند الامهات",
    "طفلي حساس وخجول كيف التعامل معه _ كيف اجعل طفلي محبوب واجتماعي؟",
    "طفلك عنيد وبيقول لا على كل حاجة؟ _ إليك الحل",
    "سنه اولى مذاكرة 📚تعليم الاطفال الارقام والحروف تعليم الاطفال الكتابة وعمل الواجب - دعاء كرسون",
    "حماية الأطفال من التحرش الجنسي والتنمر _ اخطاء كارثية يجب تجنبها وانشطة بديلة - دعاء كرسون",
    "الحل النهائي لعلاج ادمان الاطفال الشاشات والموبايل بدون عصبية و صراخ - دعاء كرسون"
]

#  تحويل العناوين إلى تمثيلات عددية (Embeddings)
video_embeddings = model.encode(video_titles)

#  حفظ البيانات لاستخدامها لاحقًا
np.save("E:/Models/video_titles.npy", video_titles)
np.save("E:/Models/video_embeddings.npy", video_embeddings)

print("\n تم حفظ تمثيلات الفيديوهات بنجاح!")
